// 멘토링

// 현수네 반 선생님은 반 학생들의 수학점수를 향상시키기 위해 멘토링 시스템을 만들려고 합니다.
// 멘토링은 멘토(도와주는 학생)와 멘티(도움을 받는 학생)가 한 짝이 되어 멘토가 멘티의 수학공부를 도와주는 것입니다.
// 선생님은 M번의 수학테스트 등수를 가지고 멘토와 멘티를 정합니다.
// 만약 A학생이 멘토이고, B학생이 멘티가 되는 짝이 되었다면, A학생은 M번의 수학테스트에서 모두 B학생보다 등수가 앞서야 합니다.
// M번의 수학성적이 주어지면 멘토와 멘티가 되는 짝을 만들 수 있는 경우가 총 몇 가지 인지 출력하는 프로그램을 작성하세요.

// ▣ 입력설명
// 첫 번째 줄에 반 학생 수 N(1<=N<=20)과 M(1<=M<=10)이 주어진다.
// 두 번째 줄부터 M개의 줄에 걸쳐 수학테스트 결과가 학생번호로 주어진다. 학생번호가 제일 앞에서부터 1등, 2등, ...N등 순으로 표현된다.
// 만약 한 줄에 N=4이고, 테스트 결과가 3 4 1 2로 입력되었다면 3번 학생이 1등, 4번 학생이 2등, 1번 학생이 3등, 2번 학생이 4등을 의미합니다.

// ▣ 출력설명
// 첫 번째 줄에 짝을 만들 수 있는 총 경우를 출력합니다.

// ▣ 입력예제 1
// 4 3(4명, 3번의 시험)
// 3 4 1 2 (3 4 1 2 는 학생 번호임. 등수랑 헷갈리지 말자)
// 4 3 2 1
// 3 1 4 2

// ▣ 출력예제 1
// 3

// (3, 1), (3, 2), (4, 2)와 같이 3가지 경우의 (멘토, 멘티) 짝을 만들 수 있다.

// 푼 시간: 1시간, GG
// 못 푼 이유:
// 1. 3, 4, 1, 2가 등수인줄 알았음.

// 강의풀이: 다시 풀어보자
function solution(test) {
  let answer = 0;
  // i = 멘토가 될 학생 번호
  // j = 멘티가 될 학생 번호
  // k = 수학 테스트 번호 (여기선 3번 문제까지 있음)
  // s = 각 테스트에서의 등수(0이면 1등, 1이면 2등, 2이면 3등, 3이면 4등임)
  for (let i = 1; i <= test[0].length; i++) {
    for (let j = 1; j <= test[0].length; j++) {
      let cnt = 0;
      for (let k = 0; k < test.length; k++) {
        let pi = 0;
        let pj = 0;
        for (let s = 0; s < test[0].length; s++) {
          if (test[k][s] === i) pi = s; // 멘토의 등수를 구하는 것(멘토의 학생 번호(i)로 등수를 찾는다)
          if (test[k][s] === j) pj = s; // 멘티의 등수를 구하는 것(멘티의 학생 번호(j)로 등수를 찾는다)
        }
        if (pi < pj) cnt++; // 멘토의 등수가 멘티의 등수보다 높다면 cnt 값을 올림
      }
      if (cnt === test.length) answer++; // cnt값이 문제 수랑 같다면 멘토의 등수가 멘티의 등수보다 모든 문제에서 높으므로 answer를 ++ 함
    }
  }
  return answer;
}

let arr = [
  [3, 4, 1, 2],
  [4, 3, 2, 1],
  [3, 1, 4, 2],
];
console.log(solution(arr));
